{"[UNK]":0,"[CLS]":1,"[SEP]":2,"[PAD]":3,"[MASK]":4,"\u0001":5,"\n":6," ":7,"!":8,"\"":9,"#":10,"$":11,"%":12,"&":13,"'":14,"(":15,")":16,"*":17,"+":18,",":19,"-":20,".":21,"/":22,"0":23,"1":24,"2":25,"3":26,"4":27,"5":28,"6":29,"7":30,"8":31,"9":32,":":33,";":34,"<":35,"=":36,">":37,"?":38,"@":39,"A":40,"B":41,"C":42,"D":43,"E":44,"F":45,"G":46,"H":47,"I":48,"J":49,"K":50,"L":51,"M":52,"N":53,"O":54,"P":55,"Q":56,"R":57,"S":58,"T":59,"U":60,"V":61,"W":62,"X":63,"Y":64,"Z":65,"[":66,"\\":67,"]":68,"^":69,"_":70,"`":71,"a":72,"b":73,"c":74,"d":75,"e":76,"f":77,"g":78,"h":79,"i":80,"j":81,"k":82,"l":83,"m":84,"n":85,"o":86,"p":87,"q":88,"r":89,"s":90,"t":91,"u":92,"v":93,"w":94,"x":95,"y":96,"z":97,"{":98,"|":99,"}":100,"~":101,"£":102,"Å":103,"Ç":104,"„":105,"in":106,"st":107,"on":108," a":109,"th":110,", ":111," in":112,"te":113,"or":114,"li":115,"ing":116," a ":117,"e ":118,",\"":119,"re":120," in ":121,"\"\n":122,"to":123,"er":124," f":125,"yth":126,"ython":127,"list":128,")\"\n":129,"le":130,"\"\"":131,"('":132,"ow":133,"da":134,"me":135," to":136,"ti":137,"ar":138,"str":139,"t ":140,"an":141,"s ":142,"al":143," to ":144,"', ":145,"of":146,")\n":147,"Python":148,"di":149,"How":150,"um":151,"ro":152,"ing ":153,"co":154,"se":155," for":156,",How":157,"ex":158,"t(":159,"ra":160,"ue":161," for ":162,"of ":163,"string":164,"ta":165,"d ":166,"', '":167,"en":168,"y ":169,"ite":170,"tion":171,"ch":172,"= ":173,"val":174,"ge":175,"la":176,"dic":177,"python":178,"list ":179,"ma":180,"s.":181,"de":182,": ":183,"ke":184,"the ":185,"fi":186,"\"\"\"\"":187,",How to ":188,"ver":189,"up":190,"lo":191,"')":192,"  ":193,"df":194,"value":195,"wi":196,"?,\"":197,"pa":198,"()":199,"rom":200,"with":201,"un":202,"\\\\":203,"ter":204,"']":205,"ce":206,"key":207,"ec":208,"['":209,"date":210,"item":211," an":212,".s":213," in Python":214,"?,":215,"time":216," from":217,"o ":218,"con":219,"si":220,"ur":221,"ll":222," in a ":223,"10":224,"men":225,"le ":226,"Python ":227,"anda":228,"tionar":229,"num":230,"ind":231,"sor":232,"if":233,"na":234," in python":235,"dictionar":236,"ele":237,"')\"\n":238,"20":239,"t('":240,"rin":241,"ub":242,"]\n":243,"ip":244,"with ":245,"list of ":246,"))\"\n":247,"mp":248,"pli":249,"ul":250,"\\n":251,"mo":252,"prin":253,"us":254,"')\n":255,"data":256,") for ":257,",How ":258,"1,":259,"2,":260,"col":261,"I ":262,"is":263,"my":264,"ran":265,"rea":266," ar":267,".f":268,"4,":269,"16":270,"3,":271,"ca":272,"d(":273,"t a ":274," = ":275,"mb":276,"8,":277,"name":278,"7,":279,"s,\"":280,"ment":281,"9,":282,"12":283,"umn":284,"list(":285,"5,":286,"tr":287,"df.":288,"]\"\n":289,"ac":290,"s()":291,"6,":292,"column":293,"if ":294,"me ":295,"andas ":296,"15":297,"st ":298,"file":299,"13":300,"19":301,"0,":302,"path":303,"py":304,"14":305,"s,":306,"ut":307,"op":308,"ray":309,"mov":310,"d.":311," from a ":312,"of a ":313,"17":314,"ting ":315,"lamb":316,"lambda":317,"key=":318,"datetime":319,"[1":320,"do ":321,"sub":322,"18":323,"lambda ":324,"Re":325,"[0":326,"ing a ":327,"))\n":328,"tup":329,"res":330,"element":331,") ":332,").":333,"), ":334,"at":335,"ber":336,"os.":337,"te ":338,"by":339,"s in a ":340,"xt":341,"oin":342," fi":343,"rame":344,"tw":345,"number":346," into":347,"len":348,"sorte":349,"print(":350,"ord":351,"string ":352,"22":353,"code":354,"conver":355,"ct":356,"lin":357,"Da":358,"pla":359,"char":360,"mat":361,"row":362,"sion":363,"datetime.":364,"el":365,"an ":366,"    ":367,"do":368,"- ":369,"='":370,"ea":371,",How do ":372,".j":373,"ie":374,"p.":375,"by ":376,"acter":377,"ll ":378,"character":379,"k ":380,"ob":381,"ss":382,"t_":383,"all":384,"items()":385,"(x":386,"\"\"\"\"\"\"":387,"sorted(":388,"00":389,"par":390,"sc":391,"s in ":392," from ":393,"dictionary":394,"ab":395,"ol":396,"x in ":397," array":398,"tuple":399,"23":400,"Tr":401,"gro":402,"sum":403," of ":404,"using ":405,"ge(":406,"how":407,"wa":408,"remov":409,".join":410,"(a":411,"key=lambda ":412,"Con":413,"obj":414,"group":415,"get":416,"python ":417,".spli":418,"index":419,"zip":420,"for":421,"pe":422,"pro":423," an ":424,",How do I ":425,"can ":426,"wh":427,"ect":428,"ulti":429,"[0]":430,"+ ":431,"1, ":432,"np.":433,"so":434,"var":435,"get ":436,"Data":437,"True":438,"pandas ":439," all ":440,"dict":441,"').":442,"ic":443,"pp":444,"com":445,"2, ":446,"qu":447,"ren":448,"er ":449,"\\n    ":450,"()\n":451,"])\"\n":452,"al ":453," in Python,\"":454,"is ":455,"ne":456,"url":457,"numpy":458," in python,\"":459,"line":460,"way":461,"it":462,"x: ":463," and ":464,"range(":465,"two ":466,".join(":467,"im":468,"ist":469,"que":470,"s from a ":471,",How can ":472,"spli":473,"object":474,"ba":475,"ce ":476,"i in ":477,"plo":478,"repla":479,"chec":480,"open":481,"code('":482,"Conver":483,"DataF":484,"dex":485,"ha":486,"teg":487,"lib":488,":\\n    ":489,"[:":490,"reg":491,"my_":492,"=True":493,"ang":494,"string,\"":495,"read":496,"ser":497,"dataf":498,"k, ":499,"text":500,"df['":501,"\\x":502,"multi":503,",How can I ":504," integ":505," to a ":506,"Python: ":507,"exp":508,"tain":509,"iter":510,"values":511,"dictionary ":512,"Pandas ":513,"uni":514,".sub":515,"': ":516,"], ":517,"n ":518,"sh":519,"on ":520,"list,":521,"oo":522,"re.sub":523,"ces":524," in python,":525,".split('":526,"' ":527,")]\"\n":528,"-1":529,"id":530,"xis":531,"rame ":532,"way to ":533,"__":534,"no":535,"ting a ":536,"the":537,"comp":538,"how to ":539,")]\n":540,"11":541,"cur":542,"orma":543,"string,":544,"dom":545,"zip(":546,"Ge":547,"sy":548," index":549," into ":550,"convert ":551,"re.sub('":552,"dir":553,"\"\"\"\"\"\"\"\"":554,"loa":555,"ou":556,"p(":557,"cod":558,"random":559,"ctor":560,"plot":561,", a":562,"== ":563,"Sor":564,"iab":565,"pd.":566,"ue ":567,"inda":568,", '":569,"ar ":570,"ch ":571,"check ":572,"sp":573,"word":574,"s of a ":575,"variab":576,"k, v":577," integer":578,"indall":579,"[x":580,"ht":581,"ir":582,"oth":583,"se ":584,"ste":585,"=True)\"\n":586,"(?":587,".items()":588,"[i":589,"sa":590,"re.f":591,"dict(":592,"fic":593,"path.":594,"replace":595,"[(":596,"sv":597,"dire":598," in Python?,":599,"utf":600,"len(":601,"expres":602,"ate":603,"ct ":604,"ction":605,"one":606,"value ":607,"xis=":608," with ":609,".str":610,"] for ":611,"csv":612,"hex":613,"s?,\"":614,"key=lambda x: ":615,"new":616,"open('":617,"indall('":618,"bin":619,"ri":620,"tur":621,"re.":622,"reque":623,"dictionarie":624," file":625,"some":626,"base":627,"spec":628,"3, ":629,"x ":630,"ten":631,"en ":632,"'))\"\n":633,"pass":634," in Python,":635,".find":636," into a ":637,"dataframe":638,"(['":639,"be":640,"du":641,"jang":642,"ind ":643,".forma":644,"remove ":645,"re.findall('":646,"speci":647,"app":648,"rip":649,"spa":650,"map(":651,"verse":652,"'])\"\n":653," in Python?,\"":654,"os.path.":655,"groupby":656,"director":657,"expression":658,"//":659,"bu":660,"lter":661,"ty":662,"{'":663,"lists":664,"coun":665,"end":666,"time('":667,"print('":668,"tri":669,"scrip":670,"sum(":671,"code ":672,"ly":673,"panda":674,"tra":675,"s of ":676,"list of tuple":677,"ular ":678,"d.items()":679,"DataFrame":680,"multip":681,"curren":682,"))":683,"0, ":684,"per":685,"te a ":686,"How to ":687,"[1, ":688,"Remov":689,"s=":690,"t.":691,"int(":692," in list(":693,"set(":694,"'))\n":695," anoth":696,".sor":697,"request":698,"based ":699,"ck":700,"s(":701,"test":702,"set_":703,"exist":704,"contain":705,"ment ":706,"replace('":707,"-8":708,"po":709,"time ":710,"s = ":711,"s with ":712,"del":713,"comm":714,":\\n    pass":715,".format(":716,"specific":717,"ular expression":718," + ":719,"%Y":720,"99":721,"Djang":722,",How to":723," for x in ":724,"unction":725,"code('utf":726," == ":727,"* ":728,"7,How to ":729,"Co":730,"der":731,"es":732,"s, ":733,"sen":734,"ray ":735,"file ":736,") for x in ":737,"subpro":738,"datetime.datetime.":739,"2.":740,"Str":741,"_list":742,"low":743,"son":744,"x.":745,"reverse":746,"log":747,"\\\\d":748," (":749," if ":750,"Num":751,"Panda":752,"crea":753,"foo":754,"ni":755,"our":756,"tp":757,"uti":758,"ve":759,"wr":760,"siz":761,"Python - ":762,"if a ":763," array ":764,"convert a ":765,"Convert ":766,"lib.":767,"variable":768,"subproces":769,"-%":770,"5,How to ":771,"8,How to ":772,"dd":773,"tter":774,"roun":775,"set":776,"'].":777,"Reg":778,"directory":779,".sort(":780,"ge ":781,"ig":782,"lst":783,"mon":784,"s from ":785,"txt":786,",\"df.":787,"t the ":788,"exec":789," in python?,\"":790,"remove":791,"i in range(":792,"specific ":793,"amp":794,"from":795,"ly ":796,"s)\"\n":797,"s to ":798,", b":799,"retur":800,"extra":801,"tion ":802,"order":803,"match":804,"http":805,"river":806,"subprocess.":807,"'.join(":808,"1)\"\n":809,"6,How to ":810,"Ch":811,"driver":812,"gen":813,",\"sorted(":814,"().":815,"multiple ":816,"([":817,"List":818,"gu":819,"min":820,"sing":821,"or ":822,"and":823,"max":824," in Python ":825,"file.":826,"regex":827,"binar":828,"script":829," another ":830,"lower":831,"43":832,"gi":833,"ile":834,"pu":835,"ve ":836," as":837,") if ":838,"matplot":839,"regular expression":840,"3, 4":841,"current ":842,"'s ":843,"5, ":844,"80":845,"> ":846,"d in ":847,"imp":848,"ting":849,"int":850,", y":851," int":852,"alse":853,"sele":854,"sort a ":855,"use ":856,"ack":857,"st way to ":858,"parse":859,"based on ":860,"1.":861,"Crea":862,"False":863,"None":864,"SO":865,"at ":866,"cu":867,"call":868,"ff":869,"{0":870,"star":871,"tool":872,"str(":873,"set ":874,"\\\\s":875,"'], ":876,"list of list":877,"filename":878," file ":879,"get the ":880,"ic ":881,"\"\"\"\"\"\"\"\"\"\"\"\"":882,"out ":883,", axis=":884,"stem":885,"execu":886,")', '":887,":%":888,"://":889,"Find":890,"ST":891,"\\u":892,"json":893,"over":894,"we":895,"erat":896,"array":897,"strip":898,"dec":899,"fir":900,"'] = ":901,"cate":902," array,\"":903,"DataFrame ":904,"'}":905,"4,How to ":906,"])\n":907,"emp":908,"vel":909,"one ":910,"to ":911,"list,\"":912,"um ":913,"tab":914,"cho":915,"loc":916,"loat":917,"\\\\w":918,"100":919,"element ":920,"ello":921,"itertool":922,"system":923,"itertools.":924,"!= ":925,"'.format(":926,"((":927,")))\"\n":928,"):\\n    pass":929,"So":930,"_by":931,"i ":932,"now":933,"out":934,"stan":935,"erate":936,"string to ":937,"list of":938,"dele":939,"cep":940,"item in ":941,"user":942,"numpy.":943,"write":944,"month":945,"return ":946,"matplotlib":947,"\"\"\"\"\"\"\"\"\"\"\"\".join(":948,"()\"\n":949,"1)":950,"30":951,"3,How to ":952,"9,How to ":953,"Sele":954,"a.":955,"ation":956,"ftime('":957,"hen":958,"hea":959,"ml":960,"pl":961,"put":962,"s)":963,"that ":964,"arch":965,"t = ":966,"Python,\"":967,"loop":968,"values in a ":969,"mbin":970,"resul":971,"Get ":972,"set_index":973,"String":974,"+)":975,"Find ":976,"[^":977,"ame":978,"gth":979,"i, ":980,"s?,":981,"your":982," a string":983,"rehen":984,"strp":985,"def":986,"upli":987,"key, ":988,"123":989,"column ":990,"[1]":991,"lambda x: ":992,"number of ":993,"line ":994,"each ":995,"whe":996,"pandas dataframe":997,"' %":998,"not":999}